<details><summary>Show Plan</summary>

```terraform
module.s3_hosting.random_id.this: Refreshing state... [id=ylnPWRAqCZM]
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-prod]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-prod]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-prod]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-prod]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-prod]
module.s3_hosting.aws_s3_bucket.this: Refreshing state... [id=coffee-run-web-prod-ca59cf59102a0993]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-prod]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-prod]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-prod-20231206165907477100000003]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-prod-20231206165907497100000004]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-prod-20231206165907459900000002]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-prod-20231206165907459800000001]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-prod]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-prod]
module.api_app.aws_api_gateway_api_key.this: Refreshing state... [id=r242yimvi1]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=a0zpgqqrs2]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=5fakqp]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=kttj2y]
module.s3_hosting.aws_cloudfront_origin_access_control.this: Refreshing state... [id=E87ZPFIPIJMNZ]
module.api_app.aws_api_gateway_method.get_daily_coffee: Refreshing state... [id=agm-a0zpgqqrs2-kttj2y-GET]
module.api_app.aws_api_gateway_method.opt_daily_coffee: Refreshing state... [id=agm-a0zpgqqrs2-kttj2y-OPTIONS]
module.s3_hosting.aws_cloudfront_distribution.this: Refreshing state... [id=E24W2TBAGOLQYC]
module.s3_hosting.aws_s3_bucket_policy.this: Refreshing state... [id=coffee-run-web-prod-ca59cf59102a0993]
module.api_app.aws_api_gateway_integration.get_daily_coffee: Refreshing state... [id=agi-a0zpgqqrs2-kttj2y-GET]
module.api_app.aws_api_gateway_method_response.opt_daily_coffee: Refreshing state... [id=agmr-a0zpgqqrs2-kttj2y-OPTIONS-200]
module.api_app.aws_api_gateway_integration.opt_daily_coffee: Refreshing state... [id=agi-a0zpgqqrs2-kttj2y-OPTIONS]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_integration_response.opt_daily_coffee: Refreshing state... [id=agir-a0zpgqqrs2-kttj2y-OPTIONS-200]
module.api_app.aws_api_gateway_deployment.this: Refreshing state... [id=x4yv36]
module.api_app.aws_api_gateway_stage.this: Refreshing state... [id=ags-a0zpgqqrs2-prod]
module.api_app.aws_api_gateway_usage_plan.this: Refreshing state... [id=n2tyx8]
module.api_app.aws_api_gateway_usage_plan_key.this: Refreshing state... [id=r242yimvi1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.s3_hosting.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "coffeecard-brewer.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "coffeecard-brewer.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "coffeecard-brewer.dev",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.s3_hosting.aws_acm_certificate_validation.this["coffeecard-brewer.dev"] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.s3_hosting.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                        = [
          + "coffeecard-brewer.dev",
        ]
        id                             = "E24W2TBAGOLQYC"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl            = 0 -> 3600
          ~ max_ttl                = 0 -> 86400
            # (10 unchanged attributes hidden)
        }

      ~ viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          - cloudfront_default_certificate = true -> null
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }

        # (2 unchanged blocks hidden)
    }

  # module.s3_hosting.aws_route53_record.root[0] will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "coffeecard-brewer.dev"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = "d28qjew0wfojvp.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.s3_hosting.aws_route53_record.validation["coffeecard-brewer.dev"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.s3_hosting.aws_route53_zone.this[0] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "coffeecard-brewer.dev"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`